{
  "backend/main.mo": "Main actor for the Yesfour Infra backend, handling user profile CRUD, admin user management (delete, role update, account status toggle), task operations, and leaderboard/stats queries with role-based access control and file storage mixins.",
  "backend/migration.mo": "Migration module that upgrades existing UserProfile records by adding a default `accountStatus = #active` field to all entries in the userProfiles map.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (admin Users menu, users list page, admin action controls, search/filter) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering styles, hooks, pages, and components for the Yesfour Infra Task Management app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark themes, covering background, foreground, primary, destructive, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Yesfour Infra Task Management app, mounting the React app into a `#root` div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for login, profile setup, and role-specific dashboards (employee/manager/admin) under a protected layout, plus a Sonner toaster.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component that confirms permanent user deletion, calling the `useDeleteUser` mutation and showing success/error toasts on completion.",
  "frontend/src/components/DepartmentProductivityPanel.tsx": "Card component displaying task status breakdowns, completion rate percentage, and total performance points for a given array of tasks.",
  "frontend/src/components/EditUserRoleModal.tsx": "A dialog modal that allows changing a user's role (Admin/Manager/Employee) via a dropdown, using the useUpdateUserRole mutation and showing toast notifications on success or failure.",
  "frontend/src/components/GlobalTaskList.tsx": "Renders a filterable list of tasks with dropdowns for department, status, and priority filters, displaying each task as a TaskCard with optional approval actions.",
  "frontend/src/components/Layout.tsx": "Main app shell with a sticky top navigation bar showing role-based nav links, the company logo/brand, user profile badge, and a logout button.",
  "frontend/src/components/LeaderboardTable.tsx": "Displays a ranked performance leaderboard table showing employee name, department, role, and points, fetching each user's profile by principal.",
  "frontend/src/components/ProofUploadButton.tsx": "A file upload button for task proof submission that validates file type and size, tracks upload progress, and calls the useUploadProof mutation.",
  "frontend/src/components/RejectTaskModal.tsx": "A dialog modal for rejecting a task that requires a non-empty rejection reason text, then calls the useRejectTask mutation and shows a toast on completion.",
  "frontend/src/components/StatusBadge.tsx": "A small presentational badge component that maps a TaskStatus enum value to a colored label (Overdue, In Progress, Proof Uploaded, Completed).",
  "frontend/src/components/SummaryStatsCards.tsx": "Renders a 4-card grid displaying summary statistics for total, completed, overdue, and in-progress task counts with color-coded icons.",
  "frontend/src/components/TaskApprovalActions.tsx": "Renders Approve and Reject buttons for tasks in 'blue' status, calling the approve mutation or opening a RejectTaskModal with toast feedback.",
  "frontend/src/components/TaskCard.tsx": "Displays a task's details (title, department, priority, approval status, deadline countdown) in a card layout with optional action buttons.",
  "frontend/src/components/TaskCreationForm.tsx": "Form component for creating and assigning a new task, with validation for all fields including Principal ID format, submitting via the createTask mutation.",
  "frontend/src/components/UserAccountStatusBadge.tsx": "Small badge component that displays a user's account status as 'Active' or 'Inactive' with corresponding color styling.",
  "frontend/src/components/UsersSummaryCards.tsx": "Renders a grid of four summary stat cards showing total users, active users, managers, and employees derived from a UserStats array.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that combines Internet Identity login state with the caller's user profile to expose authentication status, role flags, and logout functionality.",
  "frontend/src/hooks/useCountdown.ts": "Hook that computes a human-readable countdown string from a nanosecond deadline, updating every minute and flagging expired or urgent states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, task fetching/creation, proof uploads, task approval/rejection, admin dashboard data, and user management mutations.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind directives, and defines CSS custom properties for a corporate green light/dark theme including status color utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying summary stats, a leaderboard, all tasks, and a users list in tabs, with auth-based redirects for non-admin or unauthenticated users.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Employee dashboard page showing the authenticated user's assigned tasks with quick-stat counters and proof upload capability, redirecting unauthenticated or unregistered users.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects users to their role-appropriate dashboard or profile setup after successful sign-in.",
  "frontend/src/pages/ManagerDashboard.tsx": "Manager Dashboard page with three tabs: Create Task (TaskCreationForm), Review Tasks (GlobalTaskList with approval actions), and Productivity (DepartmentProductivityPanel). Redirects unauthenticated users and shows pending approval badge count.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile setup form for new users to enter their name, department, and role, then saves the profile via mutation and redirects to the appropriate role-based dashboard.",
  "frontend/src/pages/UsersListPage.tsx": "Admin page listing all users with search, role, and department filters, pagination, and actions to toggle account status, edit role, or delete a user.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand/task color tokens, typography, container queries, animation plugins, and design tokens (shadows, border radius, fonts) for the Yesfour Infra app.",
  "project_state.json": "Project state metadata describing the full-stack task management app for Yesfour Infra, including tech stack, architectural notes, departments, existing features, and workflow rules."
}