{
  "backend/main.mo": "Main actor for the Yesfour Infra task management app, implementing user profile management, role-based access control, task CRUD operations, proof upload/review workflows, and admin user management using mixins for storage and authorization.",
  "backend/migration.mo": "Data migration module that upgrades OldTask records to NewTask by adding four new nullable fields (submittedAt, reviewedAt, reviewComment, finalStatus), preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated source files, component dependencies, and test IDs for proof upload/review workflows on employee and admin dashboards.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering pages, hooks, components, and styling for the Yesfour Infra task management frontend.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark themes, covering background, foreground, card, primary, destructive, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Yesfour Infra Task Management app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for login, profile setup, and role-specific dashboards (employee, manager, admin) under a protected layout wrapper with a Sonner toaster.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component that confirms permanent deletion of a user by principal, calling the useDeleteUser mutation and showing success or error toasts.",
  "frontend/src/components/DepartmentProductivityPanel.tsx": "Renders a per-department productivity panel showing task completion rates and performance points as progress bars, computed from a list of TaskResponse objects.",
  "frontend/src/components/EditUserRoleModal.tsx": "A dialog modal that allows changing a user's role (admin/manager/employee) via a select input, calling the updateUserRole mutation on save.",
  "frontend/src/components/GlobalTaskList.tsx": "Displays a filterable, searchable list of tasks with filters for department, status, and priority, rendering each task as a TaskCard.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky top navigation bar with role-based nav links, user info badge, and logout functionality.",
  "frontend/src/components/LeaderboardTable.tsx": "Renders a ranked leaderboard table of users and their performance points, fetching each user's profile by principal to display name, department, and role.",
  "frontend/src/components/ProofPreviewModal.tsx": "A dialog modal that previews a submitted proof file (image or PDF) with submitter metadata and a download button.",
  "frontend/src/components/ProofReviewPanel.tsx": "Displays a submitted proof file with submitter metadata and provides admin approve/reject actions, including a reject modal for adding a review comment.",
  "frontend/src/components/ProofUploadButton.tsx": "A button component that allows employees to upload proof files (JPEG, PNG, PDF) for a task and then mark the task as completed, with upload progress tracking and toast notifications.",
  "frontend/src/components/RejectTaskModal.tsx": "A modal dialog that prompts an admin to enter a required review comment before marking a task as incomplete/rejected.",
  "frontend/src/components/StatusBadge.tsx": "Exports badge components for displaying task status (Overdue, In Progress, Pending Review, Completed), approval status (Pending, Approved, Rejected, etc.), and a proof-uploaded indicator.",
  "frontend/src/components/SummaryStatsCards.tsx": "Renders a grid of four stat cards showing total, completed, overdue, and in-progress task counts for a dashboard summary view.",
  "frontend/src/components/TaskApprovalActions.tsx": "Provides Approve and Reject action buttons for admins on a task, triggering mutations and showing a rejection reason modal when rejecting.",
  "frontend/src/components/TaskCard.tsx": "Displays a single task's details including status, priority, deadline countdown, proof upload/review panels, and rejection comments, with conditional rendering for admin vs. employee views.",
  "frontend/src/components/TaskCreationForm.tsx": "A form for admins to create new tasks, collecting title, department, assignee, description, deadline, and priority, then submitting via a mutation with validation and toast feedback.",
  "frontend/src/components/UserAccountStatusBadge.tsx": "A small badge component that displays a user's account status as either 'Active' or 'Inactive' with corresponding color styling.",
  "frontend/src/components/UsersSummaryCards.tsx": "Displays a 4-card summary grid showing total users, active users, managers, and employees counts derived from a UserStats array.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Custom hook that combines Internet Identity state with the caller's user profile to expose authentication status, role flags (admin/manager/employee), and a logout function.",
  "frontend/src/hooks/useCountdown.ts": "Custom hook that takes a deadline in nanoseconds and returns a formatted countdown string, expiry flag, and urgency flag (under 24 hours), updating every minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout flow, and expose identity state via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, task fetching/creation/mutation, and admin dashboard queries.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, configures Tailwind, and defines CSS custom properties for light/dark theme colors and status utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays summary stats cards and tabbed views for all tasks, a leaderboard, and a users list, with skeleton loading states.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Displays an employee's personal task dashboard with summary stat cards (total, completed, overdue, pending review) and a responsive grid of TaskCard components fetched for the logged-in user.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login page for Yesfour Infra, redirecting authenticated users to their role-specific dashboard or profile setup if no profile exists.",
  "frontend/src/pages/ManagerDashboard.tsx": "Manager dashboard with three tabs: task creation form, review of submitted (blue-status) tasks, and a department productivity panel, all driven by the full task list query.",
  "frontend/src/pages/ProfileSetupPage.tsx": "First-time profile setup form collecting name, email, department, and role; saves the profile via mutation and redirects to the appropriate role-based dashboard.",
  "frontend/src/pages/UsersListPage.tsx": "Admin page listing all users with search, role, and department filters, pagination, and actions to toggle account status, edit role, or delete a user via modals/dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helpers to read URL query parameters from both standard and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (brand greens, task status colors), border radius, box shadows, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 13) for a full-stack internal task management app (React + Node.js/Express + MongoDB + JWT), documenting architecture notes, existing features, known issues, and the strict task workflow with role-based access."
}