{
  "backend/main.mo": "Main actor for the task management backend, handling user profiles (CRUD, role management, active user listing), task operations (create, assign, approve/reject, proof upload), and admin user management, with authorization checks via AccessControl mixin.",
  "backend/migration.mo": "Data migration module that upgrades OldTask records to NewTask by adding nullable proof submission fields (proofSubmittedBy, proofSubmittedByEmail, submissionTimestamp) and a new #pendingReview approval status variant.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (employee proof visibility, admin proof review panel, proof upload badges) to their source files, component dependencies, and test requirement IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the frontend codebase structure and component responsibilities.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom property color tokens for light and dark themes covering background, foreground, primary, destructive, chart, and sidebar design tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Yesfour Infra Task Management app, mounting the React app at #root and loading the main.tsx module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for login, profile setup, and role-specific dashboards (employee/manager/admin) under a protected layout, plus a global Sonner toaster.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component that confirms permanent deletion of a user by principal, calling the useDeleteUser mutation and showing success/error toasts on completion.",
  "frontend/src/components/DepartmentProductivityPanel.tsx": "Displays a department productivity card showing task counts by status, completion rate percentage, and total performance points aggregated from a list of tasks.",
  "frontend/src/components/EditUserRoleModal.tsx": "A dialog modal that allows changing a user's role (admin/manager/employee) by selecting a new role and saving it via the updateUserRole mutation.",
  "frontend/src/components/GlobalTaskList.tsx": "Renders a filterable list of tasks with search, department, status, and priority filters, optionally showing admin view and approval actions.",
  "frontend/src/components/Layout.tsx": "Main application layout component providing a sticky top navigation bar with role-based nav links, branding, user info, and a logout button.",
  "frontend/src/components/LeaderboardTable.tsx": "Displays a ranked performance leaderboard table showing employee names, departments, roles, and point totals fetched per principal.",
  "frontend/src/components/ProofPreviewModal.tsx": "A dialog modal that previews task proof files (images or documents) with submission metadata, and provides a download button.",
  "frontend/src/components/ProofReviewPanel.tsx": "Displays a proof review section on a task card, showing submitter info, file thumbnail, and action buttons (preview, download, approve, reject) based on the task's current approval status.",
  "frontend/src/components/ProofUploadButton.tsx": "Renders a file upload button that accepts JPEG, PNG, or PDF files and uploads proof for a task using the uploadProof mutation, showing upload progress and toast notifications.",
  "frontend/src/components/RejectTaskModal.tsx": "A dialog modal that prompts the user to enter a rejection reason and submits it via the rejectTask mutation, closing on success or showing an error toast on failure.",
  "frontend/src/components/StatusBadge.tsx": "Exports styled badge components for task status (StatusBadge), approval status (ApprovalStatusBadge), and a proof-uploaded indicator (ProofUploadedBadge) using color-coded configurations.",
  "frontend/src/components/SummaryStatsCards.tsx": "Renders a grid of four summary stat cards displaying total, completed, overdue, and in-progress task counts with corresponding icons and color themes.",
  "frontend/src/components/TaskApprovalActions.tsx": "Provides Approve and Reject action buttons for a task; approve calls the approveTask mutation directly while reject opens the RejectTaskModal.",
  "frontend/src/components/TaskCard.tsx": "Displays a task's details (title, department, priority, status, deadline countdown, description) in a card layout with optional action slots, approval/proof badges, and an expandable ProofReviewPanel.",
  "frontend/src/components/TaskCreationForm.tsx": "A form for creating new tasks with fields for title, department, assignee (via a searchable user combobox), description, deadline, and priority, submitting via the createTask mutation.",
  "frontend/src/components/UserAccountStatusBadge.tsx": "Renders a small pill badge indicating whether a user account is Active or Inactive, styled with green or muted colors respectively.",
  "frontend/src/components/UsersSummaryCards.tsx": "Displays a 4-card summary grid showing total users, active users, total managers, and total employees derived from a list of UserStats.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Custom hook that combines Internet Identity authentication state with the caller's user profile to expose auth status, role flags, login/logout, and profile setup detection.",
  "frontend/src/hooks/useCountdown.ts": "Custom hook that takes a deadline in nanoseconds and returns a live-updating formatted countdown string along with expiry and urgency flags, refreshing every minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, task fetching/creation, and proof uploads with appropriate cache invalidation.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, configures Tailwind, and defines CSS custom properties for the corporate light/dark theme including status color utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays summary stats cards and tabbed views for overview, leaderboard, all tasks, and user management using data from admin-specific queries.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Displays the employee's personal dashboard with task statistics (total, completed, overdue, in-progress), performance points, and a grid of their assigned tasks with proof upload buttons where applicable.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with Internet Identity authentication, redirecting authenticated users to their role-appropriate dashboard or profile setup if no profile exists.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides a tabbed manager dashboard with sections for creating tasks, reviewing tasks pending approval, and viewing department productivity metrics.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Renders a profile setup form for new users to enter their name, email, department, and role, saving the profile to the backend and redirecting to the appropriate dashboard.",
  "frontend/src/pages/UsersListPage.tsx": "Admin page that lists all users with filtering by role and department, search, pagination, and actions to toggle account status, edit roles, or delete users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, brand/task status colors, typography, container queries, and animation plugins.",
  "project_state.json": "Project state manifest describing a full-stack internal task management app for Yesfour Infra, tracking architecture, existing features, known issues, and versioning metadata."
}