{
  "kind": "build_request",
  "title": "Add Proof Upload and Admin Review Workflow",
  "projectName": "Yesfour Infra Task Manager",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Extend the Task data model in the Motoko backend actor to add the following optional fields: proofFile (Text — safe relative URL or blob key), submittedAt (Int — nanosecond timestamp), reviewedAt (Int — nanosecond timestamp), reviewComment (Text), and finalStatus (variant: #pendingReview | #approved | #rejected). These fields must be stored on each task record and initialised as null/empty on task creation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Update Task schema: proofFile, submittedAt, reviewedAt, reviewComment, finalStatus (Pending Review / Approved / Rejected)"
        ]
      },
      "acceptanceCriteria": [
        "Task records in the Motoko actor include proofFile, submittedAt, reviewedAt, reviewComment, and finalStatus fields.",
        "New tasks are created with proofFile = null, submittedAt = null, reviewedAt = null, reviewComment = null, finalStatus = null.",
        "The actor compiles and deploys without errors after the schema change.",
        "Existing task records remain unaffected by the schema extension."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Add an uploadProof mutation in the Motoko backend actor. It accepts a taskId and a proof file reference (base64 string or safe URL key). It must: (1) verify the caller is the assignedTo principal of that task, returning an #unauthorized error otherwise; (2) store the proofFile value, set submittedAt to the current time, set the task's approvalStatus to #pendingReview, and set the task status to #blue (Pending Review); (3) return the updated task on success.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "PUT /tasks/upload-proof/:id",
          "Only assigned employee can upload & mark complete.",
          "After submission → status = 'Pending Review'."
        ]
      },
      "acceptanceCriteria": [
        "Calling uploadProof as the assigned employee stores proofFile and submittedAt on the task.",
        "Task status changes to Blue (#blue) and approvalStatus changes to #pendingReview on successful upload.",
        "Calling uploadProof as a different principal returns an #unauthorized error.",
        "Calling uploadProof as Admin or Manager returns an #unauthorized error."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a markComplete mutation in the Motoko backend actor. It accepts a taskId. It must: (1) verify the caller is the assignedTo principal of that task and that the task already has a proofFile uploaded, returning appropriate errors otherwise; (2) confirm the submission by recording submittedAt if not already set; (3) ensure the task's approvalStatus is #pendingReview and status is #blue. This mutation represents the employee's final confirmation after proof upload.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "PUT /tasks/mark-complete/:id",
          "Click 'Mark as Completed'.",
          "Only assigned employee can upload & mark complete."
        ]
      },
      "acceptanceCriteria": [
        "Calling markComplete as the assigned employee with a proof already uploaded succeeds and confirms the task as pending review.",
        "Calling markComplete without a prior proof upload returns an error indicating proof is required.",
        "Calling markComplete as a non-assigned principal returns an #unauthorized error."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Add an adminReviewTask mutation in the Motoko backend actor. It accepts taskId, decision (#approved | #rejected), and an optional reviewComment (Text). It must: (1) verify the caller has the Admin role, returning #unauthorized otherwise; (2) if decision is #approved: set finalStatus = #approved, approvalStatus = #approved, task status = #green, reviewedAt = now, award performance points to the assignee (+10 if deadline not passed, -5 if overdue); (3) if decision is #rejected: require a non-empty reviewComment (return error if missing), set finalStatus = #rejected, approvalStatus = #rejected, task status = #yellow (back to In Progress), reviewedAt = now, store reviewComment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "PUT /tasks/admin-review/:id",
          "Click 'Approve' → status = 'Approved'.",
          "Click 'Mark Incomplete' → status = 'Rejected'.",
          "Add review comment (required if Rejected).",
          "Only Admin can approve/reject.",
          "Return 403 if unauthorized."
        ]
      },
      "acceptanceCriteria": [
        "Calling adminReviewTask with #approved as Admin sets finalStatus = #approved, status = #green, and awards performance points.",
        "Calling adminReviewTask with #rejected and a reviewComment as Admin sets finalStatus = #rejected, status = #yellow, and stores the comment.",
        "Calling adminReviewTask with #rejected and no reviewComment returns a validation error.",
        "Calling adminReviewTask as a non-Admin principal returns #unauthorized.",
        "reviewedAt is recorded on both approve and reject."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the task query responses in the Motoko backend actor so that proof-related fields (proofFile, submittedAt, reviewedAt, reviewComment, finalStatus) are only included in the returned task record when the caller is an Admin or is the assignedTo principal of that specific task. For all other callers these fields must be omitted or returned as null.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Can view own proof and status only.",
          "Only assigned employee can upload & mark complete.",
          "Only Admin can approve/reject."
        ]
      },
      "acceptanceCriteria": [
        "An Admin calling any task query receives proofFile, submittedAt, reviewedAt, reviewComment, and finalStatus fields populated.",
        "The assigned employee calling a task query for their own task receives their proof fields.",
        "A Manager or a different employee calling the same task query receives null/omitted proof fields.",
        "Task status and approvalStatus are always returned regardless of caller role."
      ]
    },
    {
      "id": "REQ-37",
      "text": "On the Employee Dashboard (EmployeeDashboard.tsx and ProofUploadButton.tsx), add a proof upload button and a 'Mark as Completed' button to each task card where the task status is Yellow (In Progress) or Rejected. The 'Mark as Completed' button must only be enabled after a proof file has been selected and uploaded. After successful submission the task card must immediately reflect the 'Pending Review' status badge (Blue). The employee must also be able to view their own previously uploaded proof file displayed as an inline link or thumbnail within their task card. No changes to the existing design theme, spacing, or layout are permitted beyond adding these controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Upload proof file (image/pdf).",
          "Click 'Mark as Completed'.",
          "After submission → status = 'Pending Review'.",
          "Can view own proof and status only.",
          "Do NOT change UI theme or other features."
        ]
      },
      "acceptanceCriteria": [
        "Upload Proof button is visible on task cards where status is Yellow or Rejected.",
        "'Mark as Completed' button is disabled until a proof file has been uploaded.",
        "After upload and marking complete, the task card status badge changes to Blue (Pending Review).",
        "The employee's own uploaded proof file is shown as a link or thumbnail on their task card.",
        "Proof files from other employees' tasks are never shown.",
        "No chat, email, or messaging UI elements are introduced.",
        "Existing corporate theme (white background, green accent, card layout) is unchanged."
      ]
    },
    {
      "id": "REQ-38",
      "text": "On the Admin Dashboard (AdminDashboard.tsx, GlobalTaskList.tsx, TaskCard.tsx), add an Admin-only Proof Review Panel within each task card or expanded task detail that has a proofFile present. The panel must display: Employee Name, Submission Date & Time (formatted as human-readable string), an uploaded proof preview (image thumbnail or PDF icon with filename), an 'Approve' button (calls adminReviewTask with #approved), and a 'Mark Incomplete' button that opens a modal requiring a non-empty review comment before submission (calls adminReviewTask with #rejected and the comment). After admin action, the task card must immediately reflect the updated status badge (Green for Approved, Yellow/In Progress for Rejected). These admin controls must be completely hidden for Manager and Employee roles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "View all submitted proofs.",
          "See employee name + submission time.",
          "Click 'Approve' → status = 'Approved'.",
          "Click 'Mark Incomplete' → status = 'Rejected'.",
          "Add review comment (required if Rejected).",
          "Do NOT change UI theme or other features."
        ]
      },
      "acceptanceCriteria": [
        "Admin sees Proof Review Panel only on task cards where proofFile is present.",
        "Panel shows Employee Name, Submission Date & Time, and a proof file preview or PDF icon.",
        "Clicking 'Approve' calls the adminReviewTask mutation with #approved and updates the task status badge to Green.",
        "Clicking 'Mark Incomplete' opens a modal with a required review comment text area; submitting calls adminReviewTask with #rejected and the comment.",
        "Submitting the reject modal without a comment shows a validation error and does not submit.",
        "After rejection, the task status badge reverts to Yellow (In Progress) and the review comment is stored.",
        "Proof Review Panel and Approve/Mark Incomplete buttons are completely hidden for Manager and Employee roles.",
        "Existing admin dashboard layout and corporate theme remain unchanged."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Update the React Query hooks in useQueries.ts to add: (1) an uploadProof mutation hook that calls the backend uploadProof mutation with taskId and file data; (2) a markComplete mutation hook that calls the backend markComplete mutation with taskId; (3) an adminReviewTask mutation hook that calls the backend adminReviewTask mutation with taskId, decision, and optional reviewComment. All three hooks must invalidate the relevant task list queries on success. Proof-related fields in task query responses must only be stored and consumed client-side when the authenticated user is Admin or the task's own assignee.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "PUT /tasks/upload-proof/:id",
          "PUT /tasks/mark-complete/:id",
          "PUT /tasks/admin-review/:id"
        ]
      },
      "acceptanceCriteria": [
        "useUploadProof mutation hook exists and calls the backend uploadProof mutation.",
        "useMarkComplete mutation hook exists and calls the backend markComplete mutation.",
        "useAdminReviewTask mutation hook exists and calls the backend adminReviewTask mutation.",
        "All three hooks invalidate task list queries on success so the UI refreshes automatically.",
        "Proof fields are only present in client-side state when the user is Admin or the task assignee.",
        "No TypeScript compilation errors are introduced in useQueries.ts."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing corporate visual theme (white backgrounds, #2E7D32 green accent, status badge colours, card layouts, typography).",
    "Do not modify the authentication or JWT/Internet Identity login logic.",
    "Do not alter the existing performance scoring logic beyond awarding +10 or -5 points in the adminReviewTask mutation.",
    "Do not add any chat, messaging, or real-time discussion UI elements.",
    "Do not change existing dashboard layouts beyond adding the new proof upload and review controls.",
    "Do not reuse requirement IDs below REQ-32.",
    "All Motoko logic must remain in the single main actor file (backend/main.mo).",
    "Immutable frontend paths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui) must not be modified."
  ],
  "nonGoals": [
    "Real-time WebSocket or Socket.io notifications for proof events.",
    "Manager role approval/rejection of proofs (Admin only for this workflow).",
    "Chat rooms, direct messages, or discussion threads.",
    "Changes to the login page or profile setup page.",
    "Changes to the Users List page or its admin controls.",
    "Changes to the task creation form beyond what is needed for the proof workflow.",
    "External file storage services (S3, Cloudinary, etc.).",
    "Email notifications for proof submission or review decisions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}