{
  "kind": "build_request",
  "title": "Role-Based Proof File Visibility & Admin Proof Review Panel",
  "projectName": "Yesfour Infra Task Management",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update the backend Motoko actor so that proof file data (proofFile blob/path, submittedBy, submissionTimestamp) stored on a task record is only returned in query responses to the Admin role or the employee who is the assignedTo principal of that specific task. For all other callers, these fields must be omitted or nulled out in the returned task record.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Protect proof access route: GET /tasks/proof/:taskId — Allow only: Admin, The assigned employee (own task only). If other role tries → return 403 Unauthorized"
        ]
      },
      "acceptanceCriteria": [
        "When a Manager or a different Employee (not the assignee) fetches task data, proofFile URL, submittedBy, and submissionTimestamp fields are absent or null in the response.",
        "When the assigned Employee fetches their own task, proofFile URL, submittedBy, and submissionTimestamp are present.",
        "When an Admin fetches any task, proofFile URL, submittedBy, and submissionTimestamp are present.",
        "A backend query getProofForTask(taskId) enforces this role/ownership check and returns an error variant (#unauthorized) when called by an ineligible principal."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Extend the task data model in the Motoko backend to ensure that when an employee uploads proof, the task stores: proofFile (safe relative URL or blob key — never a full server path), submittedByName (employee full name), submittedByEmail (employee email), and submissionTimestamp (nanosecond timestamp). The task's approvalStatus must be set to #pendingReview upon proof upload, and status must transition to Blue (#blue) at that point.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "After uploading proof: Status changes to 'Pending Review'",
          "Submission Timestamp",
          "Submitted By (Employee Name + Email)",
          "Never expose full server path. Return only safe download URL."
        ]
      },
      "acceptanceCriteria": [
        "Task record includes submittedByName, submittedByEmail, and submissionTimestamp fields after proof upload.",
        "proofFile stores only a safe relative key/URL, not an absolute server file path.",
        "On proof upload, task status transitions to Blue and approvalStatus is set to #pendingReview.",
        "Existing approve/reject mutations remain unchanged in their logic."
      ]
    },
    {
      "id": "REQ-25",
      "text": "On the Employee Dashboard (EmployeeDashboard.tsx / ProofUploadButton.tsx), ensure that: (1) each employee can only see their own uploaded proof file (rendered inline or as a link) within their own task card; (2) proof files belonging to other employees are never fetched or displayed; (3) after upload, a 'Pending Review' label or badge appears on the task card to communicate status to the employee.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Employee can see their own uploaded proof",
          "Employee must NOT see proofs uploaded by other employees.",
          "Remove any global visibility of proof files."
        ]
      },
      "acceptanceCriteria": [
        "Employee task cards show a preview link or thumbnail for the proof only on tasks where the logged-in user is the assignee and a proof exists.",
        "No proof file link or data is rendered for tasks assigned to other employees.",
        "After proof upload, the task card displays a 'Pending Review' badge alongside the existing status badge.",
        "The ProofUploadButton remains visible only when task status is Yellow or Red (existing behaviour preserved)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "In the Admin Dashboard → All Tasks view (AdminDashboard.tsx / GlobalTaskList.tsx / TaskCard.tsx), add Admin-only visible fields to each task entry: a blue 'Proof Uploaded' badge (shown when proofFile exists), a 'View Proof' button that fetches and opens the proof (image preview or PDF) in a modal or new tab, a 'Download Proof' option, the Submission Timestamp formatted as a human-readable date/time string, and the Submitted By field showing Employee Name and Email. These fields must be completely hidden for Manager and Employee roles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Add visible fields for Admin ONLY: Proof Uploaded (Yes/No badge), View Proof Button, Download Proof Option, Submission Timestamp, Submitted By (Employee Name + Email)"
        ]
      },
      "acceptanceCriteria": [
        "In the Admin Dashboard All Tasks list, each task card/row with a proof shows a blue 'Proof Uploaded' badge.",
        "A 'View Proof' button is visible only to Admin; clicking it opens a preview modal or new tab showing the proof image/PDF.",
        "A 'Download Proof' link is available alongside the View Proof button for Admin only.",
        "Submission Timestamp is displayed in a readable format (e.g., 'DD MMM YYYY, HH:mm') for Admin.",
        "Submitted By shows 'Employee Name (email@yesfour.com)' for Admin.",
        "None of these fields are visible when the authenticated user is a Manager or Employee."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add an Admin-only Proof Review Panel section inside the Admin Task detail/expanded view in the Admin Dashboard. The panel must display: Employee Name, an uploaded file preview (image thumbnail or PDF icon with filename), Uploaded Date & Time, an Approve button (calls the existing approve mutation), and a Reject button that opens a modal requiring a rejection reason text input before submission. Add three status indicator badges used throughout the Admin view: a blue badge labelled 'Proof Uploaded', a green badge labelled 'Approved', and a red badge labelled 'Rejected', reflecting the current approvalStatus of the task.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Proof Review Section: Employee Name, Uploaded File Preview, Uploaded Date & Time, Approve Button, Reject Button (with reason)",
          "Add small blue badge: 'Proof Uploaded', Add green badge: 'Approved', Add red badge: 'Rejected'"
        ]
      },
      "acceptanceCriteria": [
        "When an Admin expands or views a task that has a proof, a 'Proof Review Section' panel is rendered.",
        "The panel shows the employee's name, a file preview (image thumbnail or PDF icon), and the formatted upload date/time.",
        "An 'Approve' button calls the existing approve task mutation and shows a success toast.",
        "A 'Reject' button opens a modal with a mandatory rejection reason input; submission calls the existing reject task mutation.",
        "A blue 'Proof Uploaded' badge appears on tasks where approvalStatus is #pendingReview.",
        "A green 'Approved' badge appears on tasks where approvalStatus is #approved.",
        "A red 'Rejected' badge appears on tasks where approvalStatus is #rejected.",
        "The panel and all three badges are invisible to Manager and Employee roles.",
        "Existing white + green corporate theme is preserved; no new colour tokens are introduced beyond the specified badge colours."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update the useQueries.ts hooks and any relevant React Query fetch logic to ensure: (1) proof-related fields (proofFile URL, submittedByName, submittedByEmail, submissionTimestamp) are only requested and stored client-side when the authenticated user is Admin or the task's own assignee; (2) a getProofForTask(taskId) query hook is added that calls the protected backend query and is only invoked from Admin-role views or the employee's own task view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Role-Based Visibility: IF role === 'Admin': Show: All uploaded proofs … ELSE: Hide: Proof files of other employees"
        ]
      },
      "acceptanceCriteria": [
        "getProofForTask hook is defined in useQueries.ts and calls the backend proof access query.",
        "The hook is only called within Admin task views or within the employee's own task card (matching assignedTo).",
        "If the backend returns an #unauthorized error, the frontend silently suppresses the proof section rather than crashing.",
        "No proof URL is stored in global query cache in a way that is accessible to Manager or other Employee components."
      ]
    }
  ],
  "constraints": [
    "Do not modify the login system or authentication flow.",
    "Do not change the task workflow state-transition rules (Yellow → Blue → Green/Red/Yellow).",
    "Do not modify the productivity/performance points scoring logic.",
    "Do not add chat, messaging, or discussion UI elements anywhere.",
    "Do not change the Employee Dashboard design beyond the 'Pending Review' badge addition and restricting others' proof visibility.",
    "Do not change the Manager Dashboard functionality.",
    "Preserve the existing white + green (#2E7D32) corporate visual theme throughout.",
    "Immutable frontend paths (useInternetIdentity, useActor, main.tsx, components/ui) must not be modified."
  ],
  "nonGoals": [
    "Adding chat or real-time messaging features.",
    "Changing the task creation or assignment workflow.",
    "Modifying the leaderboard or performance points calculation.",
    "Generating externally signed URLs via a third-party service (use backend-controlled safe URL construction instead, as the platform is ICP/Motoko).",
    "Changing the Manager's ability to approve/reject tasks (existing behaviour unchanged).",
    "Modifying the login page or Internet Identity authentication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}