{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-25T12:40:30.124Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 8,
    "implemented": 3,
    "items": [
      {
        "id": "REQ-32",
        "summary": "Extend the Task data model in the Motoko backend actor to add the following optional fields: proofFile (Text — safe relative URL or blob key), submittedAt (Int — nanosecond timestamp), reviewedAt (Int — nanosecond timestamp), reviewComment (Text), and finalStatus (variant: #pendingReview | #approved | #rejected). These fields must be stored on each task record and initialised as null/empty on task creation.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-33",
        "summary": "Add an uploadProof mutation in the Motoko backend actor. It accepts a taskId and a proof file reference (base64 string or safe URL key). It must: (1) verify the caller is the assignedTo principal of that task, returning an #unauthorized error otherwise; (2) store the proofFile value, set submittedAt to the current time, set the task's approvalStatus to #pendingReview, and set the task status to #blue (Pending Review); (3) return the updated task on success.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-34",
        "summary": "Add a markComplete mutation in the Motoko backend actor. It accepts a taskId. It must: (1) verify the caller is the assignedTo principal of that task and that the task already has a proofFile uploaded, returning appropriate errors otherwise; (2) confirm the submission by recording submittedAt if not already set; (3) ensure the task's approvalStatus is #pendingReview and status is #blue. This mutation represents the employee's final confirmation after proof upload.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-35",
        "summary": "Add an adminReviewTask mutation in the Motoko backend actor. It accepts taskId, decision (#approved | #rejected), and an optional reviewComment (Text). It must: (1) verify the caller has the Admin role, returning #unauthorized otherwise; (2) if decision is #approved: set finalStatus = #approved, approvalStatus = #approved, task status = #green, reviewedAt = now, award performance points to the assignee (+10 if deadline not passed, -5 if overdue); (3) if decision is #rejected: require a non-empty reviewComment (return error if missing), set finalStatus = #rejected, approvalStatus = #rejected, task status = #yellow (back to In Progress), reviewedAt = now, store reviewComment.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-36",
        "summary": "Update the task query responses in the Motoko backend actor so that proof-related fields (proofFile, submittedAt, reviewedAt, reviewComment, finalStatus) are only included in the returned task record when the caller is an Admin or is the assignedTo principal of that specific task. For all other callers these fields must be omitted or returned as null.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-37",
        "summary": "On the Employee Dashboard (EmployeeDashboard.tsx and ProofUploadButton.tsx), add a proof upload button and a 'Mark as Completed' button to each task card where the task status is Yellow (In Progress) or Rejected. The 'Mark as Completed' button must only be enabled after a proof file has been selected and uploaded. After successful submission the task card must immediately reflect the 'Pending Review' status badge (Blue). The employee must also be able to view their own previously uploaded proof file displayed as an inline link or thumbnail within their task card. No changes to the existing design theme, spacing, or layout are permitted beyond adding these controls.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/components/TaskCard.tsx",
          "frontend/src/components/ProofUploadButton.tsx",
          "frontend/src/pages/EmployeeDashboard.tsx"
        ],
        "matchedFiles": [
          "frontend/src/components/TaskCard.tsx",
          "frontend/src/components/ProofUploadButton.tsx",
          "frontend/src/pages/EmployeeDashboard.tsx"
        ]
      },
      {
        "id": "REQ-38",
        "summary": "On the Admin Dashboard (AdminDashboard.tsx, GlobalTaskList.tsx, TaskCard.tsx), add an Admin-only Proof Review Panel within each task card or expanded task detail that has a proofFile present. The panel must display: Employee Name, Submission Date & Time (formatted as human-readable string), an uploaded proof preview (image thumbnail or PDF icon with filename), an 'Approve' button (calls adminReviewTask with #approved), and a 'Mark Incomplete' button that opens a modal requiring a non-empty review comment before submission (calls adminReviewTask with #rejected and the comment). After admin action, the task card must immediately reflect the updated status badge (Green for Approved, Yellow/In Progress for Rejected). These admin controls must be completely hidden for Manager and Employee roles.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/components/ProofReviewPanel.tsx",
          "frontend/src/components/TaskCard.tsx",
          "frontend/src/components/RejectTaskModal.tsx",
          "frontend/src/pages/AdminDashboard.tsx",
          "frontend/src/components/GlobalTaskList.tsx"
        ],
        "matchedFiles": [
          "frontend/src/components/ProofReviewPanel.tsx",
          "frontend/src/components/TaskCard.tsx",
          "frontend/src/components/RejectTaskModal.tsx"
        ]
      },
      {
        "id": "REQ-39",
        "summary": "Update the React Query hooks in useQueries.ts to add: (1) an uploadProof mutation hook that calls the backend uploadProof mutation with taskId and file data; (2) a markComplete mutation hook that calls the backend markComplete mutation with taskId; (3) an adminReviewTask mutation hook that calls the backend adminReviewTask mutation with taskId, decision, and optional reviewComment. All three hooks must invalidate the relevant task list queries on success. Proof-related fields in task query responses must only be stored and consumed client-side when the authenticated user is Admin or the task's own assignee.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts",
          "frontend/src/hooks/useAuth.ts"
        ],
        "matchedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ]
      }
    ]
  },
  "changedFiles": [
    "backend/main.mo",
    "backend/migration.mo",
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/backend.d.ts",
    "frontend/src/backend.ts",
    "frontend/src/components/ProofReviewPanel.tsx",
    "frontend/src/components/ProofUploadButton.tsx",
    "frontend/src/components/RejectTaskModal.tsx",
    "frontend/src/components/TaskCard.tsx",
    "frontend/src/declarations/backend.did.d.ts",
    "frontend/src/declarations/backend.did.js",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/EmployeeDashboard.tsx",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}