{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Role-Based Proof File Visibility & Admin Proof Review Panel",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Restrict proof file visibility on Employee Dashboard to only the employee's own tasks and add 'Pending Review' badge",
      "acceptanceCriteria": [
        "Employee task cards show a preview link or thumbnail for the proof only on tasks where the logged-in user is the assignee and a proof exists.",
        "No proof file link or data is rendered for tasks assigned to other employees.",
        "After proof upload, the task card displays a 'Pending Review' badge alongside the existing status badge.",
        "The ProofUploadButton remains visible only when task status is Yellow or Red (existing behaviour preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add conditional rendering for proof file preview (image thumbnail or link) that only displays when the logged-in user's principal matches the task's assignedTo principal and proofFile exists. Integrate the proof preview inline within the card layout. Verify the blob-storage component's usage instructions before implementing the ExternalBlob.getDirectURL() method for rendering the proof."
        },
        {
          "path": "frontend/src/components/StatusBadge.tsx",
          "operation": "modify",
          "description": "Add a new 'Pending Review' badge variant that renders a blue badge when approvalStatus is 'pendingReview'. Ensure the badge uses the existing corporate color palette and integrates with the current size prop."
        },
        {
          "path": "frontend/src/pages/EmployeeDashboard.tsx",
          "operation": "modify",
          "description": "Pass the current user's principal from useAuth to TaskCard components so they can determine proof visibility. Ensure no proof data from other employees' tasks is rendered or accessible in the DOM."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add Admin-only proof metadata fields to All Tasks view in Admin Dashboard",
      "acceptanceCriteria": [
        "In the Admin Dashboard All Tasks list, each task card/row with a proof shows a blue 'Proof Uploaded' badge.",
        "A 'View Proof' button is visible only to Admin; clicking it opens a preview modal or new tab showing the proof image/PDF.",
        "A 'Download Proof' link is available alongside the View Proof button for Admin only.",
        "Submission Timestamp is displayed in a readable format (e.g., 'DD MMM YYYY, HH:mm') for Admin.",
        "Submitted By shows 'Employee Name (email@yesfour.com)' for Admin.",
        "None of these fields are visible when the authenticated user is a Manager or Employee."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add an isAdminView boolean prop. When true and proofFile exists, render: a blue 'Proof Uploaded' badge, a 'View Proof' button that opens the proof in a modal or new tab using ExternalBlob.getDirectURL(), a 'Download Proof' link using the same URL with download attribute, a formatted Submission Timestamp (using Intl.DateTimeFormat or date-fns), and Submitted By text showing proofSubmittedBy and proofSubmittedByEmail. Ensure all proof-related UI is hidden when isAdminView is false. Verify the blob-storage component's usage instructions before implementing ExternalBlob access."
        },
        {
          "path": "frontend/src/components/GlobalTaskList.tsx",
          "operation": "modify",
          "description": "Pass isAdminView={true} prop to TaskCard components when the authenticated user's role is Admin (retrieved via useAuth). Ensure Manager users do not receive this prop or see admin-only proof fields."
        },
        {
          "path": "frontend/src/components/ProofPreviewModal.tsx",
          "operation": "create",
          "description": "Create a new modal component that displays a proof file preview. Accept a proofFile ExternalBlob prop. Render an image preview using ExternalBlob.getDirectURL() for image files, or a PDF viewer/icon for PDF files. Include a close button and handle loading states. Use shadcn/ui Dialog component for the modal structure. Verify the blob-storage component's usage instructions before implementing ExternalBlob rendering."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Import and pass authentication context to child components. Ensure GlobalTaskList receives the current user's role so it can conditionally render admin-only proof fields."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add Admin-only Proof Review Panel with approve/reject actions and status badges to Admin task detail view",
      "acceptanceCriteria": [
        "When an Admin expands or views a task that has a proof, a 'Proof Review Section' panel is rendered.",
        "The panel shows the employee's name, a file preview (image thumbnail or PDF icon), and the formatted upload date/time.",
        "An 'Approve' button calls the existing approve task mutation and shows a success toast.",
        "A 'Reject' button opens a modal with a mandatory rejection reason input; submission calls the existing reject task mutation.",
        "A blue 'Proof Uploaded' badge appears on tasks where approvalStatus is #pendingReview.",
        "A green 'Approved' badge appears on tasks where approvalStatus is #approved.",
        "A red 'Rejected' badge appears on tasks where approvalStatus is #rejected.",
        "The panel and all three badges are invisible to Manager and Employee roles.",
        "Existing white + green corporate theme is preserved; no new colour tokens are introduced beyond the specified badge colours."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProofReviewPanel.tsx",
          "operation": "create",
          "description": "Create an Admin-only panel component that accepts a TaskResponse prop. Display: employee name (proofSubmittedBy), proof file preview (image thumbnail using ExternalBlob.getDirectURL() or PDF icon), and formatted upload date/time (submissionTimestamp). Include an 'Approve' button that calls the useApproveTask mutation and shows a success toast. Include a 'Reject' button that opens the existing RejectTaskModal component. Wrap the entire panel in a role check: only render when the current user is Admin. Use shadcn/ui Card component for the panel structure. Verify the blob-storage component's usage instructions before implementing ExternalBlob rendering."
        },
        {
          "path": "frontend/src/components/StatusBadge.tsx",
          "operation": "modify",
          "description": "Add three new approval status badge variants: 'Proof Uploaded' (blue, for approvalStatus 'pendingReview'), 'Approved' (green, for approvalStatus 'approved'), and 'Rejected' (red, for approvalStatus 'rejected'). Use the existing corporate color palette for green; add blue and red using Tailwind's default palette. Ensure badges integrate with the existing size prop and design system."
        },
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "When isAdminView is true and the task has an approvalStatus, render the appropriate approval status badge (Proof Uploaded/Approved/Rejected) below or alongside the task status badge. Add an expandable/collapsible section or detail slot where the ProofReviewPanel component can be rendered for tasks with proofFile. Ensure the panel is only visible to Admin users."
        },
        {
          "path": "frontend/src/components/GlobalTaskList.tsx",
          "operation": "modify",
          "description": "For Admin users, integrate the ProofReviewPanel into the task detail/expanded view for tasks that have a proofFile. Ensure the panel is rendered within or below the TaskCard when the user expands a task or views task details."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add role-based proof data fetching logic to React Query hooks and prevent unauthorized proof access",
      "acceptanceCriteria": [
        "getProofForTask hook is defined in useQueries.ts and calls the backend proof access query.",
        "The hook is only called within Admin task views or within the employee's own task card (matching assignedTo).",
        "If the backend returns an #unauthorized error, the frontend silently suppresses the proof section rather than crashing.",
        "No proof URL is stored in global query cache in a way that is accessible to Manager or other Employee components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetProofForTask(taskId: bigint, assignedTo: Principal) query hook that conditionally fetches proof data only when the current user is Admin or matches the assignedTo principal. The hook should return the proof-related fields (proofFile, submittedByName, submittedByEmail, submissionTimestamp) from the task. If the backend returns an error or unauthorized response, return null and suppress errors. Use a unique query key that includes the taskId and current user principal to prevent cache leakage across roles."
        },
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Replace direct proof field access with conditional useGetProofForTask hook calls when rendering proof data. Only invoke the hook when isAdminView is true or the current user matches assignedTo. Handle null/error responses gracefully by hiding the proof section without throwing errors."
        },
        {
          "path": "frontend/src/components/ProofReviewPanel.tsx",
          "operation": "modify",
          "description": "Use the useGetProofForTask hook to fetch proof data for the given task. Handle loading and error states. If proof data is unavailable or unauthorized, render a fallback message or hide the panel entirely."
        }
      ]
    }
  ]
}