{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Proof Upload and Admin Review Workflow",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Add proof upload and mark-complete controls to Employee Dashboard task cards",
      "acceptanceCriteria": [
        "Upload Proof button is visible on task cards where status is Yellow or Rejected.",
        "'Mark as Completed' button is disabled until a proof file has been uploaded.",
        "After upload and marking complete, the task card status badge changes to Blue (Pending Review).",
        "The employee's own uploaded proof file is shown as a link or thumbnail on their task card.",
        "Proof files from other employees' tasks are never shown.",
        "No chat, email, or messaging UI elements are introduced.",
        "Existing corporate theme (white background, green accent, card layout) is unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add conditional rendering for proof upload section when task status is Yellow (In Progress) or has finalStatus rejected. Display ProofUploadButton and a 'Mark as Completed' button that is disabled until proofFile exists. Show the employee's own uploaded proof file as an inline link or thumbnail using the ExternalBlob getDirectURL() method. Ensure proof preview is only shown for the current user's own tasks. Use the blob-storage component to handle ExternalBlob display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProofUploadButton.tsx",
          "operation": "modify",
          "description": "Extend the existing ProofUploadButton component to call the uploadProof mutation hook after file selection completes. Update the component to accept a taskId prop and trigger the mutation with the selected ExternalBlob file data. Add toast notifications for upload success and error states. Ensure the button remains within the existing card layout and styling. Use the blob-storage component's ExternalBlob.fromBytes() and withUploadProgress() methods to track upload progress. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EmployeeDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the EmployeeDashboard correctly passes task data to TaskCard components so that proof upload controls are rendered when appropriate. Verify that the query invalidation after proof upload or markComplete mutations will refresh the task list automatically. No structural changes to the dashboard layout or theme are required."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add Admin Proof Review Panel to Admin Dashboard task cards",
      "acceptanceCriteria": [
        "Admin sees Proof Review Panel only on task cards where proofFile is present.",
        "Panel shows Employee Name, Submission Date & Time, and a proof file preview or PDF icon.",
        "Clicking 'Approve' calls the adminReviewTask mutation with #approved and updates the task status badge to Green.",
        "Clicking 'Mark Incomplete' opens a modal with a required review comment text area; submitting calls adminReviewTask with #rejected and the comment.",
        "Submitting the reject modal without a comment shows a validation error and does not submit.",
        "After rejection, the task status badge reverts to Yellow (In Progress) and the review comment is stored.",
        "Proof Review Panel and Approve/Mark Incomplete buttons are completely hidden for Manager and Employee roles.",
        "Existing admin dashboard layout and corporate theme remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProofReviewPanel.tsx",
          "operation": "modify",
          "description": "Update ProofReviewPanel to display Employee Name (using the proofSubmittedBy field or assignedTo principal resolved to a UserProfile name), Submission Date & Time (formatted from submittedAt bigint timestamp), and a proof file preview using ExternalBlob's getDirectURL() for images or a PDF icon with filename for PDFs. Replace existing approve/reject logic to call the adminReviewTask mutation hook with decision parameter #approved or #rejected. Integrate RejectTaskModal for collecting the required reviewComment when rejecting. Add toast notifications for success and error states. Use the blob-storage component to render the proof file preview. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add conditional rendering to show ProofReviewPanel within the task card only when the current user is an Admin (using the isAdmin flag from useAuth) and the task has a proofFile present. Ensure ProofReviewPanel is completely hidden for Manager and Employee roles. Position the panel within the existing card structure without altering the overall layout or theme."
        },
        {
          "path": "frontend/src/components/RejectTaskModal.tsx",
          "operation": "modify",
          "description": "Update RejectTaskModal to accept a new onRejectWithComment callback that receives the reviewComment text. Ensure the modal validates that the comment is non-empty before allowing submission. Add error feedback if the user attempts to submit without entering a comment. Maintain existing modal styling and layout."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the AdminDashboard passes complete task data (including proofFile, submittedAt, reviewedAt, reviewComment, finalStatus) to TaskCard and GlobalTaskList so that proof review controls render correctly. Verify that the adminReviewTask mutation invalidates task queries on success to refresh the UI automatically. No structural changes to the dashboard layout or tabs are required."
        },
        {
          "path": "frontend/src/components/GlobalTaskList.tsx",
          "operation": "modify",
          "description": "Ensure GlobalTaskList passes complete task data to TaskCard components so that proof review controls are rendered when appropriate for Admin users. No filter or layout changes are required."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add React Query hooks for proof upload, mark complete, and admin review mutations",
      "acceptanceCriteria": [
        "useUploadProof mutation hook exists and calls the backend uploadProof mutation.",
        "useMarkComplete mutation hook exists and calls the backend markComplete mutation.",
        "useAdminReviewTask mutation hook exists and calls the backend adminReviewTask mutation.",
        "All three hooks invalidate task list queries on success so the UI refreshes automatically.",
        "Proof fields are only present in client-side state when the user is Admin or the task assignee.",
        "No TypeScript compilation errors are introduced in useQueries.ts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add three new mutation hooks: useUploadProof (accepts taskId: bigint and file: ExternalBlob, calls actor.uploadProof), useMarkComplete (accepts taskId: bigint, calls actor.markComplete), and useAdminReviewTask (accepts taskId: bigint, decision: FinalStatus, reviewComment: string | null, calls actor.adminReviewTask). Each mutation hook must invalidate the relevant task list query keys on success (e.g., 'allTasks', 'tasksForCaller', 'tasksForUser'). Ensure the TypeScript types match the backend interface (FinalStatus enum, ExternalBlob class). Use the blob-storage component's ExternalBlob class for file handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Ensure the useAuth hook correctly exposes the isAdmin flag and that proof-related fields from task queries are only consumed when the authenticated user is Admin or the task's assignedTo principal. No structural changes to the authentication logic are required."
        }
      ]
    }
  ]
}